
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>EFS 加密文件系统 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="crypto.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://huoyijie.cn" target="_blank" class="custom-link">huoyijie.cn</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    EFS 加密文件系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="crypto.html">
            
                <a href="crypto.html">
            
                    
                    密码学方法
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >EFS 加密文件系统</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="efs-&#x52A0;&#x5BC6;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;">EFS &#x52A0;&#x5BC6;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h1>
<h2 id="&#x8FDB;&#x5165;-efs-&#x7F51;&#x7AD9;">&#x8FDB;&#x5165; EFS &#x7F51;&#x7AD9;</h2>
<p><a href="https://huoyijie.cn/efs/" target="_blank">&#x8FDB;&#x5165; EFS &#x7F51;&#x7AD9;</a></p>
<h2 id="&#x7CFB;&#x7EDF;&#x4ECB;&#x7ECD;">&#x7CFB;&#x7EDF;&#x4ECB;&#x7ECD;</h2>
<p><a href="https://huoyijie.cn/efs/" target="_blank">EFS (Encrypting File System)</a> &#x662F;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x3001;&#x52A0;&#x5BC6;&#x3001;<a href="https://john-millikin.com/the-fuse-protocol" target="_blank">FUSE</a> &#x7B49;&#x6280;&#x672F;&#x91C7;&#x7528; <code>golang</code> &#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x7F51;&#x7EDC;&#x52A0;&#x5BC6;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x5B58;&#x50A8;&#x4E8E;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x9762;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x7684;&#x9690;&#x79C1;&#x5B89;&#x5168;&#xFF0C;&#x53EA;&#x6709;&#x6570;&#x636E;&#x6240;&#x6709;&#x8005;&#x62E5;&#x6709;&#x5BC6;&#x94A5;&#x548C;&#x5BC6;&#x7801;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5BF9;&#x91CD;&#x8981;&#x6570;&#x636E;&#x505A;&#x8FDC;&#x7A0B;&#x5907;&#x4EFD;&#x3002;</p>
<p>EFS &#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x670D;&#x52A1;&#x7AEF;&#x8F6F;&#x4EF6;&#x7EC4;&#x6210;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x652F;&#x6301; Windows/Mac/Linux &#x7CFB;&#x7EDF;&#xFF0C;&#x8FD0;&#x884C;&#x5728;&#x7528;&#x6237;&#x7535;&#x8111;&#x4E0A;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x8F6F;&#x4EF6;&#x8FD0;&#x884C;&#x5728;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x7528;&#x6237;&#x53EA;&#x9700;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x597D;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x6CE8;&#x518C;&#x5E10;&#x53F7;&#x5E76;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x4F7F;&#x7528; EFS &#x5BA2;&#x6237;&#x7AEF;&#x4E86;&#xFF0C;&#x8FD0;&#x884C; EFS &#x5BA2;&#x6237;&#x7AEF;&#x540E;&#xFF0C;&#x7535;&#x8111;&#x4E0A;&#x76F8;&#x5F53;&#x4E8E;&#x6302;&#x8F7D;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x8FDC;&#x7A0B;&#x201D;&#x79FB;&#x52A8;&#x786C;&#x76D8;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;</p>
<p>EFS &#x5BA2;&#x6237;&#x7AEF;&#x57FA;&#x4E8E; FUSE (Filesystem in Userspace) &#x5B9E;&#x73B0;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x4F9D;&#x8D56;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#x7EC4;&#x4EF6;&#x3002;&#x6587;&#x6863;&#x7684;&#x540E;&#x9762;&#x90E8;&#x5206;&#x4E5F;&#x4F1A;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x5B89;&#x88C5;&#x7CFB;&#x7EDF;&#x4F9D;&#x8D56;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x5B89;&#x88C5;">&#x5982;&#x4F55;&#x5B89;&#x88C5;</h2>
<p>&#x7528;&#x6237;&#x9700;&#x8981;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6; efscli &#x53CA;&#x5176;&#x4F9D;&#x8D56;&#x7EC4;&#x4EF6;&#x3002;&#x5176;&#x4E2D; efscli &#x662F;&#x9884;&#x7F16;&#x8BD1;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x4E0B;&#x8F7D;&#x540E;&#x4FEE;&#x6539;&#x6743;&#x9650;&#x53EF;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x3002;</p>
<h3 id="windows">Windows</h3>
<ul>
<li><p><a href="https://winfsp.dev/" target="_blank">WinFsp</a></p>
<p>  &#x70B9;&#x51FB; <a href="https://winfsp.dev/rel/" target="_blank">WinFsp &#x8FDB;&#x5165;&#x4E0B;&#x8F7D;&#x9875;&#x9762;</a>&#xFF0C; &#x53EF;&#x4EE5;&#x770B;&#x5230; Download WinFsp Installer &#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#xFF0C;&#x70B9;&#x51FB;&#x4E0B;&#x8F7D;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x70B9;&#x51FB; <a href="https://github.com/winfsp/winfsp/releases/download/v1.12/winfsp-1.12.22301.msi" target="_blank">winfsp-1.12.22301.msi</a> &#x4E0B;&#x8F7D;&#x3002;&#x4E0B;&#x8F7D;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x8FD0;&#x884C; WinFsp &#x5B89;&#x88C5;&#x5668;&#xFF0C;&#x6309;&#x7167;&#x63D0;&#x793A;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#x3002;</p>
</li>
<li><p>&#x4E0B;&#x8F7D; EFS &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6; </p>
<p>  &#x70B9;&#x51FB;&#x4E0B;&#x8F7D; <a href="https://cdn.huoyijie.cn/efs/downloads/efscli-0.5.0-windows-amd64.exe" target="_blank">efscli-windows-amd64.exe</a></p>
</li>
</ul>
<h3 id="mac">Mac</h3>
<ul>
<li><p><a href="https://osxfuse.github.io/" target="_blank">macFUSE</a></p>
<p>  &#x70B9;&#x51FB; <a href="https://osxfuse.github.io/" target="_blank">macFUSE &#x8FDB;&#x5165;&#x4E0B;&#x8F7D;&#x9875;&#x9762;</a>&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5DE6;&#x4FA7;&#x770B;&#x5230; macFUSE 4.4.1 &#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#xFF0C;&#x70B9;&#x51FB;&#x4E0B;&#x8F7D;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x70B9;&#x51FB; <a href="https://github.com/osxfuse/osxfuse/releases/download/macfuse-4.4.1/macfuse-4.4.1.dmg" target="_blank">macfuse-4.4.1.dmg</a> &#x4E0B;&#x8F7D;&#x3002;&#x4E0B;&#x8F7D;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x8FD0;&#x884C; macfuse-4.4.1.dmg &#x5B89;&#x88C5;&#x5668;&#xFF0C;&#x6309;&#x7167;&#x63D0;&#x793A;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#x3002;</p>
</li>
<li><p>&#x4E0B;&#x8F7D; EFS &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;</p>
<p>  &#x70B9;&#x51FB;&#x4E0B;&#x8F7D; <a href="https://cdn.huoyijie.cn/efs/downloads/efscli-0.5.0-darwin-amd64" target="_blank">efscli-darwin-amd64</a></p>
</li>
</ul>
<h3 id="linux">Linux</h3>
<p>&#x5E38;&#x89C1;&#x7684; Linux &#x53D1;&#x884C;&#x7248;&#x5728;&#x5185;&#x6838;&#x4E2D;&#x90FD;&#x5185;&#x7F6E; FUSE &#x652F;&#x6301;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x989D;&#x5916;&#x7684;&#x4F9D;&#x8D56;&#x7EC4;&#x4EF6;&#x3002;</p>
<ul>
<li><p>&#x4E0B;&#x8F7D; EFS &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;</p>
<p>  &#x70B9;&#x51FB;&#x4E0B;&#x8F7D; <a href="https://cdn.huoyijie.cn/efs/downloads/efscli-0.5.0-linux-amd64" target="_blank">efscli-linux-amd64</a></p>
</li>
</ul>
<h2 id="&#x5982;&#x4F55;&#x4F7F;&#x7528;">&#x5982;&#x4F55;&#x4F7F;&#x7528;</h2>
<ul>
<li><p>&#x70B9;&#x51FB; <a href="https://huoyijie.cn/efs/signup" target="_blank">&#x6CE8;&#x518C;&#x5E10;&#x53F7;</a></p>
<p>  &#x6CE8;&#x518C;&#x6682;&#x65F6;&#x4E0D;&#x9700;&#x8BBE;&#x7F6E;&#x767B;&#x5F55;&#x5BC6;&#x7801;&#xFF0C;&#x901A;&#x8FC7;&#x90AE;&#x4EF6;&#x63A5;&#x6536;&#x9A8C;&#x8BC1;&#x7801;&#x540E;&#x81EA;&#x52A8;&#x767B;&#x5F55;&#xFF0C;&#x540E;&#x7EED;&#x5982;&#x679C;&#x767B;&#x5F55;&#x72B6;&#x6001;&#x5931;&#x6548;&#x540E;&#xFF0C;&#x53EF;&#x518D;&#x901A;&#x8FC7;&#x90AE;&#x4EF6;&#x9A8C;&#x8BC1;&#x7801;&#x8FDB;&#x884C;&#x767B;&#x5F55;&#x3002;</p>
</li>
<li><p>&#x70B9;&#x51FB; <a href="https://huoyijie.cn/efs/auth/acc/keysettings" target="_blank">&#x7533;&#x8BF7;&#x4EE3;&#x7801;</a></p>
<p>  &#x6B64;&#x5904;&#x7533;&#x8BF7;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5728;&#x540E;&#x9762;&#x751F;&#x6210;&#x5BA2;&#x6237;&#x7AEF;&#x5BC6;&#x94A5;&#x65F6;&#x4F1A;&#x7528;&#x5230;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x628A;&#x5BA2;&#x6237;&#x7AEF;&#x5BC6;&#x94A5;&#x5173;&#x8054;&#x5230;&#x767B;&#x5F55;&#x5E10;&#x53F7;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x59A5;&#x5584;&#x4FDD;&#x7BA1;&#xFF0C;&#x786E;&#x4FDD;&#x4E0D;&#x8981;&#x6CC4;&#x6F0F;&#x7ED9;&#x4ED6;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x8FC7;&#xFF0C;&#x5219;&#x4F1A;&#x7ACB;&#x523B;&#x5931;&#x6548;&#xFF0C;&#x4E0D;&#x80FD;&#x591F;&#x518D;&#x751F;&#x6210;&#x65B0;&#x7684;&#x5BC6;&#x94A5;&#x3002;</p>
</li>
<li><p>&#x8FD0;&#x884C; efscli &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;</p>
<p>  &#x5728;&#x4E0A;&#x4E00;&#x8282;&#x5B89;&#x88C5;&#x73AF;&#x8282;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0B;&#x8F7D;&#x4E86;&#x76F8;&#x5E94;&#x5E73;&#x53F0;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#xFF0C;Mac/Linux &#x5E73;&#x53F0;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x53EF;&#x6267;&#x884C;&#x6743;&#x9650;</p>
<pre class="language-"><code class="lang-bash">  <span class="token comment"># Mac</span>
  <span class="token comment"># &#x8BBE;&#x7F6E;&#x53EF;&#x6267;&#x884C;&#x6743;&#x9650;</span>
  $ <span class="token function">chmod</span> a+x ./efscli-darwin-amd64

  <span class="token comment"># &#x8FD0;&#x884C; efscli &#x5BA2;&#x6237;&#x7AEF;</span>
  $ ./efscli-darwin-amd64
</code></pre>
<p>  &#x6216;&#x8005;</p>
<pre class="language-"><code class="lang-bash">  <span class="token comment"># Linux</span>
  <span class="token comment"># &#x8BBE;&#x7F6E;&#x53EF;&#x6267;&#x884C;&#x6743;&#x9650;</span>
  $ <span class="token function">chmod</span> a+x ./efscli-linux-amd64

  <span class="token comment"># &#x8FD0;&#x884C; efscli &#x5BA2;&#x6237;&#x7AEF;</span>
  $ ./efscli-linux-amd64
</code></pre>
<p>  Windows &#x53EF;&#x4EE5;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53CC;&#x51FB; <code>efscli-0.5.0-windows-amd64.exe</code> &#x6587;&#x4EF6;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x3002;</p>
</li>
<li><p>&#x9996;&#x6B21;&#x8FD0;&#x884C;&#xFF0C;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;</p>
<p>  &#x9996;&#x6B21;&#x8FD0;&#x884C;&#x9700;&#x8981;&#x751F;&#x6210;&#x672C;&#x5730;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#xFF0C;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x8F93;&#x5165;&#x7F51;&#x7AD9;&#x4E0A;&#x7533;&#x8BF7;&#x7684;<code>&#x4EE3;&#x7801;</code>&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x7528;&#x6765;&#x4FDD;&#x62A4;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x8BE5;&#x5BC6;&#x7801;&#x4F1A;&#x7528;&#x6765;&#x5BF9;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x672C;&#x8EAB;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x3002;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x4F1A;&#x81EA;&#x52A8;&#x767B;&#x5F55; EFS &#x7CFB;&#x7EDF;&#x3002;</p>
</li>
<li><p>&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x540E;&#xFF0C;&#x518D;&#x6B21;&#x8FD0;&#x884C;</p>
<p>  &#x6B64;&#x65F6;&#x53EA;&#x9700;&#x8981;&#x8F93;&#x5165;&#x521A;&#x521A;&#x8BBE;&#x7F6E;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x5BF9;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x89E3;&#x5BC6;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x81EA;&#x52A8;&#x767B;&#x5F55; EFS &#x7CFB;&#x7EDF;&#x3002;</p>
</li>
<li><p>&#x767B;&#x5F55; EFS &#x7CFB;&#x7EDF;</p>
<p>  &#x7C7B;&#x4F3C;&#x63D2;&#x5165;&#x79FB;&#x52A8;&#x786C;&#x76D8;&#x5230;&#x7535;&#x8111;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F1A;&#x81EA;&#x52A8;&#x6302;&#x8F7D;&#xFF0C;Mac/Linux &#x4F1A;&#x628A;&#x865A;&#x62DF;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7A7A;&#x95F4;&#x6302;&#x8F7D;&#x5728; <code>~/efscloud</code> &#x76EE;&#x5F55;&#x4E0B;&#xFF0C;Windows &#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x76D8;&#x7B26;&#xFF0C;&#x5982; <code>Z:\</code>&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x60F3;&#x4F7F;&#x7528;&#x79FB;&#x52A8;&#x786C;&#x76D8;&#x4E00;&#x6837;&#xFF0C;&#x6B63;&#x5E38;&#x8BFB;&#x5199; EFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;</p>
</li>
<li><p>&#x4FEE;&#x6539;&#x6635;&#x79F0;</p>
<p>  &#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x5E10;&#x53F7;&#x6635;&#x79F0;&#xFF0C;&#x663E;&#x793A;&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#xFF0C;&#x8FDB;&#x5165;&#x5E10;&#x53F7;&#x4FE1;&#x606F;&#x9875;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x5E10;&#x53F7;&#x6635;&#x79F0;&#x3002;</p>
</li>
<li><p>&#x8BBE;&#x7F6E;&#x5BC6;&#x94A5;&#x6807;&#x7B7E;</p>
<p>  &#x5B58;&#x5728;&#x591A;&#x4E2A;&#x5BC6;&#x94A5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x7ED9;&#x5BC6;&#x94A5;&#x8BBE;&#x7F6E;&#x6807;&#x7B7E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x767B;&#x5F55;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x660E;&#x786E;&#x8BFB;&#x53D6;&#x7684;&#x662F;&#x54EA;&#x4E2A;&#x5BC6;&#x94A5;&#x3002;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x5E10;&#x53F7;&#x6635;&#x79F0;&#xFF0C;&#x663E;&#x793A;&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#xFF0C;&#x8FDB;&#x5165;&#x7BA1;&#x7406;&#x5BC6;&#x94A5;&#x9875;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x5BC6;&#x94A5;&#x6807;&#x7B7E;&#x3002;</p>
</li>
</ul>
<h2 id="&#x5B89;&#x5168;&#x9690;&#x79C1;">&#x5B89;&#x5168;&#x9690;&#x79C1;</h2>
<ul>
<li><p>&#x901A;&#x4FE1;&#x5B89;&#x5168;</p>
<p>  efscli &#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x7AEF;&#x8F6F;&#x4EF6;&#x4F1A;&#x5EFA;&#x7ACB; TLS &#x5B89;&#x5168;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x6709;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x52A0;&#x5BC6;&#x4FDD;&#x62A4;&#x3002;</p>
</li>
<li><p>&#x6570;&#x636E;&#x52A0;&#x5BC6;</p>
<p>  &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E3B;&#x8981;&#x7684;&#x654F;&#x611F;&#x6570;&#x636E;&#x4E3A;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x3001;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x3001;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF0C;&#x5728; efscli &#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x654F;&#x611F;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x52A0;&#x5BC6;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#xFF0C;&#x6570;&#x636E;&#x4EE5;&#x52A0;&#x5BC6;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;</p>
<p>  efscli &#x5BA2;&#x6237;&#x7AEF;&#x4ECE;&#x670D;&#x52A1;&#x7AEF;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x5BC6;&#x6587;&#xFF0C;&#x4E5F;&#x4F1A;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x89E3;&#x5BC6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x628A;&#x89E3;&#x5BC6;&#x540E;&#x7684;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x7ED9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>  &#x4ECE;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5B58;&#x653E;&#x5728; EFS &#x4E2D;&#x7684;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#x4E0E;&#x6B63;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x78C1;&#x76D8;&#x6216;&#x8005;&#x79FB;&#x52A8;&#x786C;&#x76D8;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x6570;&#x636E;&#x5374;&#x662F;&#x52A0;&#x5BC6;&#x5B58;&#x50A8;&#x7684;&#x3002;</p>
</li>
<li><p>&#x5BC6;&#x94A5;&#x5B89;&#x5168;</p>
<p>  &#x9996;&#x6B21;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#xFF0C;&#x9700;&#x8981;&#x8F93;&#x5165;<code>&#x4EE3;&#x7801;</code>&#xFF0C;&#x4E3A;&#x4E86;&#x6B63;&#x5E38;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x4E0D;&#x8981;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x6CC4;&#x6F0F;&#x7ED9;&#x4EFB;&#x4F55;&#x4EBA;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x8BE5;<code>&#x4EE3;&#x7801;</code>&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x6B64;<code>&#x4EE3;&#x7801;</code>&#x5C31;&#x7ACB;&#x523B;&#x5931;&#x6548;&#x4E86;&#x3002;</p>
<p>  &#x751F;&#x6210;&#x7684;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#xFF0C;&#x5BC6;&#x94A5;&#x5185;&#x5BB9;&#x672C;&#x8EAB;&#x662F;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5BC6;&#x7801;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x867D;&#x7136;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x5728;&#x7528;&#x6237;&#x7684;&#x7535;&#x8111;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x5176;&#x4ED6;&#x4EBA;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x624B;&#x6BB5;&#x62FF;&#x5230;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#xFF0C;&#x6CA1;&#x6709;&#x5BC6;&#x7801;&#xFF0C;&#x4E5F;&#x662F;&#x65E0;&#x6CD5;&#x8BFB;&#x53D6; EFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x7684;&#x3002;</p>
<p>  &#x4F46;&#x662F;&#xFF0C;&#x8BF7;&#x4FDD;&#x62A4;&#x597D;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x8981;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x6CC4;&#x6F0F;&#x7ED9;&#x4EFB;&#x4F55;&#x4EBA;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x4E0D;&#x4E22;&#x5931;&#xFF0C;&#x6700;&#x597D;&#x5BF9;&#x8BE5;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x505A;&#x597D;&#x5907;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x4FDD;&#x5B58;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x5176;&#x4ED6;&#x5DE5;&#x4F5C;&#x7535;&#x8111;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x79FB;&#x52A8;&#x786C;&#x76D8;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x8BF7;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x90FD;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x5907;&#x4EFD;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x7535;&#x8111;&#x786C;&#x76D8;&#x635F;&#x574F;&#xFF0C;&#x6216;&#x8005;&#x610F;&#x5916;&#x5220;&#x9664;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5907;&#x4EFD;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x3002;</p>
<p>  &#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x4E0D;&#x4F1A;&#x4EE5;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#xFF0C;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#xFF0C;&#x9075;&#x5FAA;<code>&#x96F6;&#x4FE1;&#x4EFB;</code>&#x539F;&#x5219;&#xFF0C;efscli &#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x76F8;&#x4FE1;&#x670D;&#x52A1;&#x7AEF;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x4F1A;&#x628A;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5373;&#x4F7F;&#x5BC6;&#x94A5;&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x52A0;&#x5BC6;&#x7684;&#x3002;</p>
<p>  &#x53EA;&#x6709;&#x7528;&#x6237;&#x8BBE;&#x7F6E;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x8BFB;&#x53D6;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x3002;</p>
</li>
<li><p>&#x5BC6;&#x7801;&#x5B89;&#x5168;</p>
<p>  &#x751F;&#x6210;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x8BBE;&#x7F6E;&#x4E86;&#x5BC6;&#x7801;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BC6;&#x7801;&#x53CA;&#x8FD9;&#x4E2A;&#x5BC6;&#x7801;&#x7684;&#x4EFB;&#x4F55;&#x53D8;&#x4F53;(&#x5982; Hash)&#x4E0D;&#x4F1A;&#x88AB;&#x53D1;&#x5F80;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x3002;</p>
<p>  efscli &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x4E5F;&#x4E0D;&#x4F1A;&#x5B58;&#x50A8;&#x8BE5;&#x5BC6;&#x7801;&#x660E;&#x6587;&#xFF0C;&#x4EC5;&#x4EC5;&#x628A;&#x5BC6;&#x7801;&#x7684; <code>bcrypt Hash</code> &#x53D8;&#x4F53;&#x5B58;&#x50A8;&#x5728;&#x4E86;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x800C;&#x8FD9;&#x662F;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x56E0;&#x4E3A; <code>Hash</code> &#x7B97;&#x6CD5;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x901A;&#x8FC7; <code>Hash</code> &#x503C;&#x5F97;&#x5230;&#x539F;&#x59CB;&#x5BC6;&#x7801;&#x3002;efscli &#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x50A8;&#x5BC6;&#x7801;&#x7684; <code>bcrypt Hash</code> &#x53D8;&#x4F53;&#x7684;&#x539F;&#x56E0;&#x662F;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x5BC6;&#x7801;&#x8BA4;&#x8BC1;&#xFF0C;&#x786E;&#x4FDD;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x5BC6;&#x7801;&#x3002;</p>
<p>  &#x8FD0;&#x884C; efscli &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x65F6;&#xFF0C;&#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x624D;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x8BFB;&#x53D6;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF0C;&#x8FDB;&#x800C;&#x767B;&#x5F55; EFS &#x7CFB;&#x7EDF;&#xFF0C;&#x8BFB;&#x5199; EFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x3002;</p>
<p>  &#x7528;&#x6237;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x4E0D;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x628A;&#x5BC6;&#x7801;&#x6CC4;&#x6F0F;&#x7ED9;&#x4EFB;&#x4F55;&#x4EBA;&#xFF0C;&#x5E94;&#x8BE5;&#x4EC5;&#x628A;&#x5BC6;&#x7801;&#x8BB0;&#x5728;&#x5927;&#x8111;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x7528;&#x6237;&#x672C;&#x8EAB;&#x77E5;&#x9053;&#x5BC6;&#x7801;&#xFF0C;&#x8FDB;&#x800C;&#x4F7F;&#x7528;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#xFF0C;&#x8FDB;&#x800C;&#x767B;&#x5F55; EFS &#x7CFB;&#x7EDF;&#x8BFB;&#x5199;&#x6570;&#x636E;&#x3002;</p>
<p>  <a href="https://huoyijie.cn/efs/" target="_blank">EFS &#x7F51;&#x7AD9;</a> &#x767B;&#x5F55;&#x5E10;&#x53F7;&#x4E0D;&#x8BBE;&#x7F6E;&#x5BC6;&#x7801;&#x7684;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF0C;&#x907F;&#x514D;&#x7528;&#x6237;&#x628A;&#x767B;&#x5F55;&#x5E10;&#x53F7;&#x5BC6;&#x7801;&#x548C;&#x4FDD;&#x62A4;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x5BC6;&#x7801;&#x8BBE;&#x7F6E;&#x4E3A;&#x76F8;&#x540C;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x907F;&#x514D;&#x5728;&#x7528;&#x6237;&#x4E0D;&#x77E5;&#x60C5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x610F;&#x5916;&#x6CC4;&#x6F0F;&#x5BC6;&#x7801;&#x3002;</p>
</li>
<li><p>&#x9690;&#x79C1;&#x5B89;&#x5168;</p>
<p>  &#x7528;&#x6237;&#x5728;&#x4E0D;&#x4EE5;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x6CC4;&#x6F0F;&#x5BC6;&#x7801;&#x548C;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x5C31;&#x62E5;&#x6709;&#x4E86;&#x786E;&#x4FDD;&#x9690;&#x79C1;&#x5B89;&#x5168;&#x7684;&#x5B58;&#x50A8;&#x5728;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x201C;&#x79FB;&#x52A8;&#x786C;&#x76D8;&#x201D;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x76F8;&#x5BF9;&#x9690;&#x79C1;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728; EFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x91CC;&#x9762;&#x3002;</p>
</li>
</ul>
<h2 id="&#x6280;&#x672F;&#x5B9E;&#x73B0;">&#x6280;&#x672F;&#x5B9E;&#x73B0;</h2>
<ul>
<li><p>efscli &#x5BA2;&#x6237;&#x7AEF;&#x67B6;&#x6784;&#x56FE;</p>
<p>  <img src="https://cdn.huoyijie.cn/efs/umls/arch-1.0.0.svg" alt="efscli &#x5BA2;&#x6237;&#x7AEF;"></p>
</li>
<li><p>privkey &#x5BC6;&#x94A5;&#x6587;&#x4EF6;</p>
<p>  <img src="https://cdn.huoyijie.cn/efs/umls/privkey.svg" alt="privkey &#x5BC6;&#x94A5;&#x6587;&#x4EF6;"></p>
</li>
</ul>
<table>
<thead>
<tr>
<th>&#x5B57;&#x6BB5;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>KeyId</td>
<td>&#x5BC6;&#x94A5;ID</td>
</tr>
<tr>
<td>AccId</td>
<td>&#x5E10;&#x53F7;ID</td>
</tr>
<tr>
<td>Email</td>
<td>&#x767B;&#x5F55;&#x5E10;&#x53F7;</td>
</tr>
<tr>
<td>PassHashAndBcrypt</td>
<td>bcrypt(sha256(&#x5BC6;&#x7801;&#x660E;&#x6587;), 14)</td>
</tr>
<tr>
<td>EcdsaPublicKey</td>
<td>&#x7B7E;&#x540D;&#x9A8C;&#x8BC1;&#x516C;&#x94A5;</td>
</tr>
<tr>
<td>EcdsaPrivateKey</td>
<td>aes.Encrypt(&#x7B7E;&#x540D;&#x9A8C;&#x8BC1;&#x79C1;&#x94A5;, sha256(&#x5BC6;&#x7801;&#x660E;&#x6587;))</td>
</tr>
<tr>
<td>RsaPublicKey</td>
<td>&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x516C;&#x94A5;</td>
</tr>
<tr>
<td>RsaPrivateKey</td>
<td>aes.Encrypt(&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x79C1;&#x94A5;, sha256(&#x5BC6;&#x7801;&#x660E;&#x6587;))</td>
</tr>
<tr>
<td>AesPrivateKey</td>
<td>rsa.Encrypt(&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x5BC6;&#x94A5;, RsaPublicKey)</td>
</tr>
</tbody>
</table>
<p><code>&#x5BC6;&#x7801;&#x660E;&#x6587;</code>: &#x662F;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x3002;<code>PassHashAndBcrypt</code> &#x662F;&#x5BC6;&#x7801;&#x660E;&#x6587;&#x5148;&#x7ECF;&#x8FC7; <code>sha256</code> &#x54C8;&#x5E0C;&#xFF0C;&#x518D;&#x7ECF;&#x8FC7; <code>bcrypt</code> &#x54C8;&#x5E0C;&#x5F97;&#x5230;&#x3002;&#x662F;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x5BC6;&#x7801;&#x9A8C;&#x8BC1;&#x7684;&#xFF0C;&#x5728; efscli &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x5185;&#x6821;&#x9A8C;&#x7528;&#x6237;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5BC6;&#x7801;&#x660E;&#x6587;&#x53CA;&#x5BC6;&#x7801;&#x7684;&#x4EFB;&#x4F55;&#x53D8;&#x4F53;&#x90FD;&#x4E0D;&#x4F1A;&#x4E0A;&#x4F20;&#x81F3;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;efscli &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x4F1A;&#x968F;&#x673A;&#x751F;&#x6210; 3 &#x4E2A;&#x5BC6;&#x94A5;&#xFF0C;&#x5206;&#x522B;&#x662F; <code>ecdsa</code> &#x516C;&#x79C1;&#x94A5;&#x3001;<code>rsa</code> &#x516C;&#x79C1;&#x94A5;&#x548C; <code>aes</code> &#x5BC6;&#x94A5;&#x3002;</p>
<p><code>ecdsa</code> &#x5BC6;&#x94A5;&#x662F;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x8FDB;&#x884C;&#x5BA2;&#x6237;&#x7AEF;&#x8BA4;&#x8BC1;&#x7684;&#xFF0C;&#x9996;&#x6B21;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x65F6;&#xFF0C;<code>ecdsa</code> &#x516C;&#x94A5;&#x4F1A;&#x4E0A;&#x4F20;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#xFF0C;&#x540E;&#x7EED;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;&#x7684;&#x767B;&#x5F55;&#x8BF7;&#x6C42;&#x53C2;&#x6570;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x7B7E;&#x540D;&#xFF0C;&#x5E76;&#x7531;&#x670D;&#x52A1;&#x7AEF;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x9A8C;&#x8BC1;&#x3002;</p>
<p><code>rsa</code> &#x5BC6;&#x94A5;&#x662F;&#x7528;&#x6765;&#x52A0;&#x5BC6;&#x5BA2;&#x6237;&#x7AEF;&#x654F;&#x611F;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x76EE;&#x524D;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x52A0;&#x5BC6; <code>aes</code> &#x5BC6;&#x94A5;&#x3002;&#x672A;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x654F;&#x611F;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x4F1A;&#x901A;&#x8FC7; <code>rsa</code> &#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x3002;</p>
<p><code>aes</code> &#x5BC6;&#x94A5;&#x662F;&#x7528;&#x6765;&#x5BF9;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x3001;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x4EE5;&#x53CA;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x654F;&#x611F;&#x6570;&#x636E; <code>EcdsaPrivateKey</code>&#x3001;<code>RsaPrivateKey</code>&#x3001;<code>AesPrivateKey</code> &#x90FD;&#x662F;&#x52A0;&#x5BC6;&#x5B58;&#x50A8;&#x7684;&#x3002;</p>
<p><code>KeyId</code> &#x662F;&#x751F;&#x6210;&#x7684;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;&#x7531;&#x670D;&#x52A1;&#x7AEF;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x3002;</p>
<p><code>AccId</code> &#x53CA; <code>Email</code> &#x662F;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x5173;&#x8054;&#x7684;&#x5E10;&#x53F7;&#x4FE1;&#x606F;&#xFF0C;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x65F6;&#x4F1A;&#x8981;&#x6C42;&#x7528;&#x6237;&#x8F93;&#x5165;<code>&#x4EE3;&#x7801;</code>&#xFF0C;&#x4EE3;&#x7801;&#x662F;&#x5FC5;&#x987B;&#x767B;&#x5F55;&#x7F51;&#x7AD9;&#x540E;&#xFF0C;&#x901A;&#x8FC7;<code>&#x7533;&#x8BF7;&#x4EE3;&#x7801;</code>&#x5F97;&#x5230;&#x3002;</p>
<ul>
<li><p>&#x9996;&#x6B21;&#x767B;&#x5F55;EFS&#x7CFB;&#x7EDF;</p>
<p>  <img src="https://cdn.huoyijie.cn/efs/umls/signup.svg" alt="&#x9996;&#x6B21;&#x767B;&#x5F55;EFS&#x7CFB;&#x7EDF;"></p>
</li>
<li><p>&#x975E;&#x9996;&#x6B21;&#x767B;&#x5F55;EFS&#x7CFB;&#x7EDF;</p>
<p>  <img src="https://cdn.huoyijie.cn/efs/umls/signin.svg" alt="&#x975E;&#x9996;&#x6B21;&#x767B;&#x5F55;EFS&#x7CFB;&#x7EDF;"></p>
</li>
<li><p>File Transfer Protocol</p>
<p>  <code>ftp</code>&#x534F;&#x8BAE;&#x8FD0;&#x884C;&#x4E8E; <code>TLS</code> &#x5B89;&#x5168;&#x8FDE;&#x63A5;&#x4E4B;&#x4E0A;&#xFF0C;<code>ftp</code>&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x7AEF;&#x901A;&#x8FC7;<code>rpc</code>&#x8FDB;&#x884C;&#x8BF7;&#x6C42;&#x4E0E;&#x5E94;&#x7B54;&#xFF0C;&#x8BF7;&#x6C42;/&#x5E94;&#x7B54;&#x901A;&#x8FC7;<code>protobuf</code>&#x8FDB;&#x884C;&#x5E8F;&#x5217;&#x5316;&#x4E0E;&#x53CD;&#x5E8F;&#x5217;&#x5316;&#x3002;&#x5728;EFS&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x6587;&#x4EF6;&#x662F;&#x88AB;&#x5206;&#x6210;<code>4KB</code>&#x5927;&#x5C0F;&#x7684;&#x5757;&#x7684;&#x96C6;&#x5408;&#x6765;&#x8BFB;&#x6216;&#x8005;&#x5199;&#x7684;&#x3002;</p>
<p>  <img src="https://cdn.huoyijie.cn/efs/umls/fileblock.svg" alt="&#x6587;&#x4EF6;&#x5757;"></p>
<p>  &#x5982;&#x4E0A;&#x56FE;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;<code>410KB</code>&#x6587;&#x4EF6;&#x7684;&#x5757;&#x5212;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5199;&#x6587;&#x4EF6;&#xFF0C;<code>ftp</code>&#x534F;&#x8BAE;&#x4F1A;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x5185;&#x90E8;&#x5C06;&#x6570;&#x636E;&#x5757;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4F20;&#x8F93;&#x81F3;&#x670D;&#x52A1;&#x7AEF;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x3002;&#x5982;&#x679C;&#x662F;&#x8BFB;&#x6587;&#x4EF6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x7684;&#x662F;&#x52A0;&#x5BC6;&#x5757;&#xFF0C;<code>ftp</code>&#x534F;&#x8BAE;&#x4F1A;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x89E3;&#x5BC6;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x539F;&#x59CB;&#x6570;&#x636E;&#x3002;</p>
<p>  &#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;<code>ftp</code>&#x534F;&#x8BAE;&#x4F1A;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x7684;&#x52A0;&#x89E3;&#x5BC6;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x5728; efscli &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x5185;&#x90E8;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x5168;&#x7A0B;&#x6CA1;&#x6709;&#x53C2;&#x4E0E;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x8BFB;&#x5199;&#x7684;&#x6587;&#x4EF6;&#x5757;&#x6570;&#x636E;&#x90FD;&#x662F;&#x52A0;&#x5BC6;&#x7684;&#x3002;</p>
<p>  &#x660E;&#x786E;&#x7684;&#x8BF4;&#xFF0C;<code>ftp</code>&#x534F;&#x8BAE;&#x662F;&#x5BF9;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x3001;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x4EE5;&#x53CA;&#x6587;&#x4EF6;&#x5757;&#x6570;&#x636E;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x3002;&#x91C7;&#x7528; <code>aes</code> &#x5BC6;&#x94A5;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x3002;&#x800C;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x8BBA;&#x8FF0;&#x8FC7;&#xFF0C;<code>aes</code> &#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x5B58;&#x50A8;&#x4E8E;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5FC5;&#x987B;&#x6709;&#x5BC6;&#x7801;&#x624D;&#x80FD;&#x591F;&#x89E3;&#x5BC6;&#x3002;</p>
</li>
<li><p>FUSE (Filesystem in Userspace)</p>
<p>  <img src="https://cdn.huoyijie.cn/efs/umls/fuse-1.0.1.svg" alt="FUSE"></p>
</li>
</ul>
<h2 id="&#x7279;&#x522B;&#x8BF4;&#x660E;">&#x7279;&#x522B;&#x8BF4;&#x660E;</h2>
<p>&#x76EE;&#x524D; EFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5904;&#x4E8E; <code>Beta</code> &#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x4E0D;&#x4E22;&#x5931;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x5B58;&#x50A8;&#x5728; EFS &#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5728;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x4E2D;&#x6709;&#x5907;&#x4EFD;&#x3002;&#x76EE;&#x524D;&#x6BCF;&#x4E2A;&#x5E10;&#x53F7;&#x53EA;&#x80FD;&#x7533;&#x8BF7;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x5BF9;&#x5E94; <code>4GB</code> &#x4E91;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8BE5;&#x9879;&#x76EE;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6216;&#x8005;&#x6709;&#x4EFB;&#x4F55;&#x7591;&#x95EE;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x8054;&#x7CFB;&#x4F5C;&#x8005; <code>yijie.huo@foxmail.com</code>&#x3002;</p>
<h2 id="github">Github</h2>
<p><a href="https://github.com/huoyijie" target="_blank">huoyijie</a></p>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="crypto.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 密码学方法">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"EFS 加密文件系统","level":"1.1","depth":1,"next":{"title":"密码学方法","level":"1.2","depth":1,"path":"crypto.md","ref":"crypto.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-sharing","-fontsettings","-highlight","prism","code"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"code":{"copyButtons":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-hans","links":{"sidebar":{"huoyijie.cn":"https://huoyijie.cn"}},"gitbook":"*"},"file":{"path":"README.md","mtime":"2023-02-21T12:32:47.461Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-02-21T12:33:31.917Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    

    </body>
</html>

